#include <stdio.h>
int main() {
    int score_int = 90.5;
    printf("score(int)   = %d\n",score_int);

    float score_float = 90.5;
    printf("score(float) = %.1f\n",score_float);
    
    return 0;
}

/*1.ผลลัพธ์ที่ได้  ของ int: Score = 90
ผลลัพธ์ ของ fioat: Score = 90.5
2.ทำไมต้องเลือก Data Type ให้ถูกต้อง?
เพราะถ้าเลือก Data Type ไม่เหมาะสม เช่น เก็บค่าทศนิยมลงใน int จะทำให้ข้อมูลสูญหายหรือผิดเพี้ยนจากที่ตั้งใจไว้
3.อภิปรายและสรุป:
จากการทดลองพบว่า int เหมาะสำหรับตัวเลขจำนวนเต็มเท่านั้น ไม่สามรถเก็บค่าทศนิยมได
การใช้ float ทำให้โปรแกรมสามารถจัดเก้บและสารถจัดและแสดงค่าทศนิยมได้อย่างถูกต้อง ซึ้งจำเป็นมากในกรณีที่ค่ามีความละเอียด
*/