#include <stdio.h>
 
void countCall() {
    static int counter = 0 ;
    counter++;
    printf("call function: counter = %d\n", counter);
}
int main() {
    printf("starting function calls...\n");
    countCall();
    printf("Afterting first call:\n");
    countCall();
    return 0;
}
/*1.ผลลัพธ์ที่ได้ต่างกันอย่างไร? เพราะเหตุใด?
กรณีที่ 1 (static): ค่าของ counter จะจำค่าเดิมไว้ระหว่างการเรียกฟังก์ชัน
เช่น 1 → 2 → 3
กรณีที่ 2 (non-static): ค่าของ counter  จะรีเซ็ทเป็น 0 ทุกครั้งเมื่อเรียกฟังก์ชัน
ได้แก่ 1 → 1 → 1
เพราะตัวแปร static ถูกสร้างครั้งเดียว และเก็บค่าไว้ตลอดในขณะที่ int ธรรมดาจะสร้างใหม่ทุกครั้งที่เรียกฟังก์ชัน
2. ความแตกต่างสำคัญ non-static variable?
ตัวแปร non-static จะสร้างใหม่ทุกครั้งที่ฟังก์ชันถูกรียก มีอายุเพียงในช่วงที่ฟังก์ชันทำงานเท่านั้น ค่าเดิมจะหายไป
3. อภิปราย และสรุปผลที่ได้จากการทดลอง
การใช้ static มีประโยชน์เมื่อเราต้องการให้ฟังก์ชันจำสถานะ เช่น ตัวนับจำนวนครั้งที่เรียก
หากใช้ int ปกติจะทำให้ถูกรีเซ็ททำให้ไม่สามารถ ตามค่าเดิมได้
การเข้าใจความแตกต่างของตัวแปร static\non-static สำคัญในการเขียนโปรแกรมที่มีความซับซ้อน
*/